#+STARTUP: overview

* Javascript
#+BEGIN_SRC emacs-lisp
  (use-package js2-mode
    :ensure t
    :ensure ac-js2
    :init
    (progn
      (add-hook 'js-mode-hook 'js2-minor-mode)
      (add-hook 'js2-mode-hook 'ac-js2-mode)
      ))

  (use-package js2-refactor
    :ensure t
    :config 
    (progn
      (js2r-add-keybindings-with-prefix "C-c C-m")
      ;; eg. extract function with `C-c C-m ef`.
      (add-hook 'js2-mode-hook #'js2-refactor-mode)))

  (use-package tern
    :ensure tern
    :ensure tern-auto-complete
    :config
    (progn
      (add-hook 'js-mode-hook (lambda () (tern-mode t)))
      (add-hook 'js2-mode-hook (lambda () (tern-mode t)))
      (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
      (tern-ac-setup)
      ))

  ;;(use-package jade
  ;;:ensure t
  ;;)

  (use-package nodejs-repl
    :ensure t
    )

  (add-hook 'js-mode-hook
            (lambda ()
              (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-sexp)
              (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
              (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
              (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl)))
#+END_SRC

#+RESULTS:
| (lambda nil (define-key js-mode-map (kbd C-x C-e) (quote nodejs-repl-send-last-sexp)) (define-key js-mode-map (kbd C-c C-r) (quote nodejs-repl-send-region)) (define-key js-mode-map (kbd C-c C-l) (quote nodejs-repl-load-file)) (define-key js-mode-map (kbd C-c C-z) (quote nodejs-repl-switch-to-repl))) | (lambda nil (tern-mode t)) | er/add-js-mode-expansions | js2-minor-mode |

* Testing stuff
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'turn-on-flyspell)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

#+RESULTS:
| turn-on-auto-fill | turn-on-flyspell | er/add-org-mode-expansions | (lambda nil (org-bullets-mode 1)) | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-show-block-all append local] 5] | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ac/setup-current-buffer |

* eshell stuff
#+BEGIN_SRC emacs-lisp
  (use-package shell-switcher
    :ensure t
    :config 
    (setq shell-switcher-mode t)
    :bind (("C-'" . shell-switcher-switch-buffer)
           ("C-x 4 '" . shell-switcher-switch-buffer-other-window)
           ("C-M-'" . shell-switcher-new-shell)))

  ;; Visual commands
  (setq eshell-visual-commands '("vi" "screen" "top" "less" "more" "lynx"
                                 "ncftp" "pine" "tin" "trn" "elm" "vim"
                                 "nmtui" "alsamixer" "htop" "el" "elinks"
                                 ))
  (setq eshell-visual-subcommands '(("git" "log" "diff" "show")))
  (setq eshell-list-files-after-cd t)
  (defun eshell-clear-buffer ()
    "Clear terminal"
    (interactive)
    (let ((inhibit-read-only t))
      (erase-buffer)
      (eshell-send-input)))
  (add-hook 'eshell-mode-hook
            '(lambda()
               (local-set-key (kbd "C-l") 'eshell-clear-buffer)))

  (defun eshell/magit ()
    "Function to open magit-status for the current directory"
    (interactive)
    (magit-status default-directory)
    nil)

  ;; smart display stuff
  (require 'eshell)
  (require 'em-smart)
  (setq eshell-where-to-jump 'begin)
  (setq eshell-review-quick-commands nil)
  (setq eshell-smart-space-goes-to-end t)

  (add-hook 'eshell-mode-hook
            (lambda ()
              (eshell-smart-initialize)))
  ;; eshell here
  (defun eshell-here ()
    "Opens up a new shell in the directory associated with the
  current buffer's file. The eshell is renamed to match that
  directory to make multiple eshell windows easier."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 3))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (rename-buffer (concat "*eshell: " name "*"))

      (insert (concat "ls"))
      (eshell-send-input)))

  (global-set-key (kbd "C-!") 'eshell-here)

#+END_SRC

#+RESULTS:
: eshell-here

Eshell prompt

#+BEGIN_SRC emacs-lisp
  (defcustom dotemacs-eshell/prompt-git-info
    t
    "Turns on additional git information in the prompt."
    :group 'dotemacs-eshell
    :type 'boolean)

  ;; (epe-colorize-with-face "abc" 'font-lock-comment-face)
  (defmacro epe-colorize-with-face (str face)
    `(propertize ,str 'face ,face))

  (defface epe-venv-face
    '((t (:inherit font-lock-comment-face)))
    "Face of python virtual environment info in prompt."
    :group 'epe)

  (setq eshell-prompt-function
        (lambda ()
          (concat (propertize (abbreviate-file-name (eshell/pwd)) 'face 'eshell-prompt)
                  (when (and dotemacs-eshell/prompt-git-info
                             (fboundp #'vc-git-branches))
                    (let ((branch (car (vc-git-branches))))
                      (when branch
                        (concat
                         (propertize " [" 'face 'font-lock-keyword-face)
                         (propertize branch 'face 'font-lock-function-name-face)
                         (let* ((status (shell-command-to-string "git status --porcelain"))
                                (parts (split-string status "\n" t " "))
                                (states (mapcar #'string-to-char parts))
                                (added (count-if (lambda (char) (= char ?A)) states))
                                (modified (count-if (lambda (char) (= char ?M)) states))
                                (deleted (count-if (lambda (char) (= char ?D)) states)))
                           (when (> (+ added modified deleted) 0)
                             (propertize (format " +%d ~%d -%d" added modified deleted) 'face 'font-lock-comment-face)))
                         (propertize "]" 'face 'font-lock-keyword-face)))))
                  (when (and (boundp #'venv-current-name) venv-current-name)
                    (concat 
                     (epe-colorize-with-face " [" 'epe-venv-face) 
                     (propertize venv-current-name 'face `(:foreground "#2E8B57" :slant italic))
                     (epe-colorize-with-face "]" 'epe-venv-face))) 
                  (propertize " $ " 'face 'font-lock-constant-face))))
#+END_SRC

#+RESULTS:
| lambda | nil | (concat (propertize (abbreviate-file-name (eshell/pwd)) (quote face) (quote eshell-prompt)) (when (and dotemacs-eshell/prompt-git-info (fboundp (function vc-git-branches))) (let ((branch (car (vc-git-branches)))) (when branch (concat (propertize  [ (quote face) (quote font-lock-keyword-face)) (propertize branch (quote face) (quote font-lock-function-name-face)) (let* ((status (shell-command-to-string git status --porcelain)) (parts (split-string status \n t  )) (states (mapcar (function string-to-char) parts)) (added (count-if (lambda (char) (= char 65)) states)) (modified (count-if (lambda (char) (= char 77)) states)) (deleted (count-if (lambda (char) (= char 68)) states))) (when (> (+ added modified deleted) 0) (propertize (format  +%d ~%d -%d added modified deleted) (quote face) (quote font-lock-comment-face)))) (propertize ] (quote face) (quote font-lock-keyword-face)))))) (when (and (boundp (function venv-current-name)) venv-current-name) (concat (epe-colorize-with-face  [ (quote epe-venv-face)) (propertize venv-current-name (quote face) (` (:foreground #2E8B57 :slant italic))) (epe-colorize-with-face ] (quote epe-venv-face)))) (propertize  $  (quote face) (quote font-lock-constant-face))) |

* Haskell 
#+BEGIN_SRC emacs-lisp
  (use-package haskell-mode
    :ensure t
    :config
    (require 'haskell-interactive-mode)
    (require 'haskell-process)
    (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
    )

  (use-package dante
    :ensure t
    :after haskell-mode
    :commands 'dante-mode
    :init
    (add-hook 'haskell-mode-hook 'dante-mode)
    (add-hook 'haskell-mode-hook 'flycheck-mode))

  (add-hook 'dante-mode-hook
            '(lambda () (flycheck-add-next-checker 'haskell-dante
                                                   '(warning . haskell-hlint))))
#+END_SRC

#+RESULTS:
| lambda | nil | (flycheck-add-next-checker (quote haskell-dante) (quote (warning . haskell-hlint))) |

* Paredit
#+BEGIN_SRC emacs-lisp
  (use-package paredit
    :ensure t
    :defer t
    :init (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
    (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode))
#+END_SRC

#+RESULTS:
| enable-paredit-mode |
